wzurawski015/esp32_event_clean_arch/firmware/projects/demo_lcd_rgb/sdkconfig.defaults
# --- Cel (IDF i tak nadpisze przez 'idf.py set-target', ale dajmy sensowny default) ---
CONFIG_IDF_TARGET="esp32c6"
CONFIG_IDF_TARGET_ESP32C6=y

# --- Konsola UART ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# --- Flash: 8 MB (zgodnie z Twoją płytką – usuwa ostrzeżenie o 2 MB w nagłówku) ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# --- Logowanie (umiarkowane) ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# --- [Aplikacja] I2C: bezpieczniej 100 kHz + wewn. podciągi (jeśli masz taki Kconfig) ---
# Uwaga: te klucze to Twoje wpisy z Kconfig.projbuild w projekcie. Jeśli nie istnieją, IDF je pominie.
CONFIG_APP_I2C_SDA=6
CONFIG_APP_I2C_SCL=7
CONFIG_APP_I2C_HZ=100000
CONFIG_APP_I2C_PULLUP_INTERNAL=y

# Adresy DFR0464 v2.0 (LCD/RGB)
CONFIG_APP_LCD_ADDR=0x3E
CONFIG_APP_RGB_ADDR=0x2D

# --- [Aplikacja] DS18B20 (jeśli projekt korzysta) ---
CONFIG_APP_OW_GPIO=18
CONFIG_APP_DS_RES=12
CONFIG_APP_DS_PERIOD_MS=1000
